Revit 2027 API
WireConduitTypeSet.Erase Method
Removes a specified conduit type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	WireConduitType item
)
Public Overridable Function Erase (
	item As WireConduitType
) As Integer
public:
virtual int Erase(
	WireConduitType^ item
)
abstract Erase :
        item : WireConduitType -> int
override Erase :
        item : WireConduitType -> int
Parameters
item WireConduitType
The conduit type to be erased.
Return Value
Int32
The number of conduit types that were erased from the set.
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace